lee35210/nRF52840_BLE_FREERTOS_TCS34725/main.c
//TWI PIN
#define TCS34725_SDA_PIN 28
#define TCS34725_SCL_PIN 29
#define TCS34725_INT_PIN 31

//Macro that simplifies defining a TWI transaction manager instance.
NRF_TWI_MNGR_DEF(m_nrf_twi_mngr, MAX_PENDING_TRANSACTIONS, TWI_INSTANCE_ID);

//Macro creating common twi sensor instance.
NRF_TWI_SENSOR_DEF(sensor_instance, &m_nrf_twi_mngr, MAX_PENDING_TRANSACTIONS);

//Macro that creates sensor instance.
TCS34725_INSTANCE_DEF(tcs34725_instance, &sensor_instance, TCS34725_ADDR);

tcs34725_rgbc_data_t tcs34725_rgbc_str;

/*@FreeRTOS
 *
 */
#include "FreeRTOS.h"
#include "semphr.h"
#include "timers.h"
#include "task.h"
#include "nrf_sdh_freertos.h"
#include "peer_manager.h"
#include "peer_manager_handler.h"
#include "fds.h"

static TaskHandle_t m_tcs_read_rgbc_thread;
static TaskHandle_t m_ble_tcs_rgbc_send_thread;
static TaskHandle_t m_tcs_reg_all_send_thread;
static TaskHandle_t m_ble_tcs_reg_send_thread;
static TaskHandle_t m_tcs_wr_reg_thread;

static QueueHandle_t m_tcs_reg_data_queue;
static QueueHandle_t m_tcs_rgb_data_queue;
static QueueHandle_t m_tcs_cmd_queue;

static void tcs_read_all_reg_thread(void *arg);
void tcs34725_cmd_func(tcs34725_cmd_t *cmd_func_str);
void tcs34725_read_reg_cb(ret_code_t result, tcs34725_reg_data_t * p_raw_data);
void tcs34725_read_thr_cb(ret_code_t result, tcs34725_threshold_data_t * p_reg_data);

#define STACK_SIZE_CHK  //For checking thread stack size

#if NRF_LOG_ENABLED
static TaskHandle_t m_logger_thread;                                /**< Definition of Logger thread. */
#endif

static void advertising_start(void * p_erase_bonds);

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    bool delete_bonds = false;

    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            advertising_start(&delete_bonds);
            break;

        default:
            break;
    }
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;
        tcs34725_cmd_t nus_cmd_str={0};

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            do
            {
                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);

                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                {
                    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                    APP_ERROR_CHECK(err_code);
                }
            } while (err_code == NRF_ERROR_BUSY);
        }
        if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
        {
            while (app_uart_put('\n') == NRF_ERROR_BUSY);
        }

        memcpy(nus_cmd_str.cmd,p_evt->params.rx_data.p_data,3);

        if((4<p_evt->params.rx_data.length)&&(p_evt->params.rx_data.length<8))
        {
            memcpy(nus_cmd_str.data,&p_evt->params.rx_data.p_data[3],3);
        }
        else if(7<p_evt->params.rx_data.length)
        {
            memcpy(nus_cmd_str.data,&p_evt->params.rx_data.p_data[3],5);
        }
        
        if(uxQueueSpacesAvailable(m_tcs_cmd_queue)!=0)
        {
            if(pdPASS!=xQueueSend(m_tcs_cmd_queue,&nus_cmd_str,10))
            {
                NRF_LOG_INFO("NUS DATA HANLDER : Queue send fail");
            }
            xTaskNotifyGive(m_tcs_wr_reg_thread);
        }
        else
        {
            if(pdPASS!=xQueueOverwrite(m_tcs_cmd_queue,&nus_cmd_str));
            {
                NRF_LOG_INFO("NUS DATA HANLDER : Queue overwrite fail");
            }
        }
    }

