lee35210/nRF52840_BLE_FREERTOS_TCS34725/main.c
    NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality. */
static void advertising_init(void)
{
    ret_code_t             err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising. */
static void advertising_start(void * p_erase_bonds)
{
    bool erase_bonds = *(bool*)p_erase_bonds;

    if (erase_bonds)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);
    }
}

static void twi_config(void)
{
    uint32_t err_code;
    
    nrf_drv_twi_config_t const config={
      .scl=TCS34725_SCL_PIN,
      .sda=TCS34725_SDA_PIN,
      .frequency=NRF_TWI_FREQ_400K,
      .interrupt_priority=APP_IRQ_PRIORITY_MID,
      };
    
    err_code=nrf_twi_mngr_init(&m_nrf_twi_mngr,&config);
    APP_ERROR_CHECK(err_code);
}

/**@brief A function which is hooked to idle task.
 * @note Idle hook must be enabled in FreeRTOS configuration (configUSE_IDLE_HOOK).
 */
void vApplicationIdleHook( void )
{
#if NRF_LOG_ENABLED
     vTaskResume(m_logger_thread);
#endif
}

/**@brief Function for initializing the clock.
 */
static void clock_init(void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);
}

/*@Threads
 */
#if NRF_LOG_ENABLED
static void logger_thread(void * arg)
{
    UNUSED_PARAMETER(arg);

    while (1)
    {
        NRF_LOG_FLUSH();

        vTaskSuspend(NULL); // Suspend myself
    }
}
#endif

/**@brief Application main function.
 */
int chartoint(char *char_value, uint8_t length)
{
    uint16_t int_val=0;
    for(int i=length-1; 0<=i; i--)
    {
        int_val+=((int)*char_value-48)*(pow(10,i));
        char_value++;
    }
    return int_val;
}

void tcs34725_cmd_func(tcs34725_cmd_t *cmd_func_str)
{
//    static tcs34725_reg_data_t tcs_cmd_str={0};

    tcs34725_reg_data_t *tcs_cmd_str=(tcs34725_reg_data_t*)pvPortMalloc(sizeof(tcs34725_reg_data_t));
    tcs34725_threshold_data_t *tcs_cmd_thr=(tcs34725_threshold_data_t*)pvPortMalloc(sizeof(tcs34725_threshold_data_t));

    ret_code_t err_code;

    if(strcmp(cmd_func_str->cmd,"RAR")==0)
    {
        if(pdPASS!=xTaskCreate(tcs_read_all_reg_thread, "TCS_READ_ALL_REG", configMINIMAL_STACK_SIZE+30,
                       NULL, 3, &m_tcs_reg_all_send_thread))
        {
            APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
        }
    }
    else if(strcmp(cmd_func_str->cmd,"TIM")==0)
    {
        NRF_LOG_INFO("Set Timming");
        err_code=tcs34725_set_timing(&tcs34725_instance,chartoint(cmd_func_str->data,3));
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Set timing fail");
            return;
        }
        tcs_cmd_str->reg_addr=TCS34725_REG_TIMING;
        err_code=tcs34725_read_reg(&tcs34725_instance,tcs_cmd_str,tcs34725_read_reg_cb);
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Read timing fail");
            return;
        }
    }
    else if(strcmp(cmd_func_str->cmd,"WAT")==0)
    {
        NRF_LOG_INFO("Set Wait Time");
        err_code=tcs34725_set_wait_time(&tcs34725_instance,chartoint(cmd_func_str->data,3));
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Set wait time fail");
            return;
        }
        tcs_cmd_str->reg_addr=TCS34725_REG_WAIT_TIME;
        err_code=tcs34725_read_reg(&tcs34725_instance,tcs_cmd_str,tcs34725_read_reg_cb);
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Read wait time fail");
            return;
        }
    }
    else if(strcmp(cmd_func_str->cmd,"GIN")==0)
    {
        NRF_LOG_INFO("Set gain");
        err_code=tcs34725_set_gain(&tcs34725_instance,chartoint(cmd_func_str->data,3));
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Set gain fail");
            return;
        }
        tcs_cmd_str->reg_addr=TCS34725_REG_CONTROL;
        err_code=tcs34725_read_reg(&tcs34725_instance,tcs_cmd_str,tcs34725_read_reg_cb);
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Read gain fail");
            return;
        }
    }
    else if(strcmp(cmd_func_str->cmd,"ENA")==0)
    {
        NRF_LOG_INFO("Set interrupt");
        err_code=tcs34725_set_interrupt(&tcs34725_instance,chartoint(cmd_func_str->data,3));
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Set interrupt fail");
            return;
        }
        tcs_cmd_str->reg_addr=TCS34725_REG_ENABLE;
        err_code=tcs34725_read_reg(&tcs34725_instance,tcs_cmd_str,tcs34725_read_reg_cb);
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Read interrupt fail");
            return;
        }
    }
    else if(strcmp(cmd_func_str->cmd,"WLO")==0)
    {
        NRF_LOG_INFO("Set wait long");
        err_code=tcs34725_set_wait_long(&tcs34725_instance,chartoint(cmd_func_str->data,3));
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Set wait long fail");
            return;
        }
        tcs_cmd_str->reg_addr=TCS34725_REG_CONFIG;
        err_code=tcs34725_read_reg(&tcs34725_instance,tcs_cmd_str,tcs34725_read_reg_cb);
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Read wait long fail");
            return;
        }
    }
    else if(strcmp(cmd_func_str->cmd,"PER")==0)
    {
        uint8_t persistence_val;
        NRF_LOG_INFO("Set Persistence");
        persistence_val=chartoint(cmd_func_str->data,3);
        persistence_val=tcs34725_per_dectobin(persistence_val);
        err_code=tcs34725_set_persistence(&tcs34725_instance,persistence_val);
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Set Persistence fail");
            return;
        }
        tcs_cmd_str->reg_addr=TCS34725_REG_PERSISTENCE;
        err_code=tcs34725_read_reg(&tcs34725_instance,tcs_cmd_str,tcs34725_read_reg_cb);
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Read Persistence fail");
            return;
        }
    }
    else if(strcmp(cmd_func_str->cmd,"THL")==0)
    {
        NRF_LOG_INFO("Set Threshold Low");
        err_code=tcs34725_set_threshold(&tcs34725_instance,TCS34725_THRESHOLD_LOW,chartoint(cmd_func_str->data,5));
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Set Threshold Low fail");
            return;
        }
        tcs_cmd_thr->reg_addr=TCS34725_REG_THRESHOLD_LOW_L;
        err_code=tcs34725_read_threshold(&tcs34725_instance, tcs_cmd_thr, tcs34725_read_thr_cb);
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Read Threshold Low fail");
            return;
        }
    }
    else if(strcmp(cmd_func_str->cmd,"THH")==0)
    {
        NRF_LOG_INFO("Set Threshold High");
        err_code=tcs34725_set_threshold(&tcs34725_instance,TCS34725_THRESHOLD_HIGH,chartoint(cmd_func_str->data,5));
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Set Threshold High fail");
            return;
        }
        tcs_cmd_thr->reg_addr=TCS34725_REG_THRESHOLD_HIGH_L;
        err_code=tcs34725_read_threshold(&tcs34725_instance, tcs_cmd_thr, tcs34725_read_thr_cb);
        if(err_code!=NRF_SUCCESS)
        {
            NRF_LOG_INFO("Read Threshold High fail");
            return;
        }
    }
    else
    {
        return;
    }
    vPortFree(tcs_cmd_thr);
    vPortFree(tcs_cmd_str);
}

/*@Callback
 */
void tcs34725_read_reg_cb(ret_code_t result, tcs34725_reg_data_t * p_raw_data)
{
    char read_reg_cb_cmd[]="CMD";
    uint8_t persistence_value;
    uint16_t reg_value;

