lee35210/nRF52840_BLE_FREERTOS_TCS34725/main.c
    if(result!=NRF_SUCCESS)
    {
        NRF_LOG_INFO("TCS34725 register read fail");
        return;
    }
    p_raw_data->reg_addr&=0x1F;

    switch(p_raw_data->reg_addr)
    {
        case TCS34725_REG_ENABLE :
            NRF_LOG_INFO("Enable register : %X",p_raw_data->reg_data);
            strcpy(read_reg_cb_cmd,"ENA");
            break;
        case TCS34725_REG_TIMING :
            NRF_LOG_INFO("Timing register : %X",p_raw_data->reg_data);
            strcpy(read_reg_cb_cmd,"TIM");
//            p_raw_data->reg_data=256-p_raw_data->reg_data;
            reg_value=256-p_raw_data->reg_data;
            break;
        case TCS34725_REG_WAIT_TIME :
            NRF_LOG_INFO("Wait time register : %X",p_raw_data->reg_data);
            strcpy(read_reg_cb_cmd,"WAT");
//            p_raw_data->reg_data=256-p_raw_data->reg_data;
            reg_value=256-p_raw_data->reg_data;
            break;
        case TCS34725_REG_PERSISTENCE :
            NRF_LOG_INFO("Persistence register : %X",p_raw_data->reg_data);
            strcpy(read_reg_cb_cmd,"PER");
            persistence_value=p_raw_data->reg_data;
            persistence_value=tcs34725_per_bintodec(persistence_value);
            p_raw_data->reg_data=persistence_value;
            break;
        case TCS34725_REG_CONFIG :
            NRF_LOG_INFO("Configuration register : %X",p_raw_data->reg_data);
            strcpy(read_reg_cb_cmd,"WLO");
            break;
        case TCS34725_REG_CONTROL :
            NRF_LOG_INFO("Control register : %X",p_raw_data->reg_data);
            strcpy(read_reg_cb_cmd,"GIN");
            break;
        case TCS34725_REG_ID :
            NRF_LOG_INFO("ID register : %X",p_raw_data->reg_data);
            strcpy(read_reg_cb_cmd,"IDR");
            break;
        case TCS34725_REG_STATUS :
            NRF_LOG_INFO("Status register : %X",p_raw_data->reg_data);
            strcpy(read_reg_cb_cmd,"STA");
            break;
        default :
            break;
    }
    
    tcs34725_ble_reg_t tcs_ble_send_str;
    if((p_raw_data->reg_addr==TCS34725_REG_TIMING)||(p_raw_data->reg_addr==TCS34725_REG_WAIT_TIME))
    {
        sprintf(tcs_ble_send_str.send_data,"%s%3d",read_reg_cb_cmd,reg_value);
    }
    else
    {
        sprintf(tcs_ble_send_str.send_data,"%s%3d",read_reg_cb_cmd,p_raw_data->reg_data);
    }
  
    if(uxQueueSpacesAvailable(m_tcs_reg_data_queue)!=0)
    {
        if(pdPASS!=xQueueSend(m_tcs_reg_data_queue,&tcs_ble_send_str,10))
        {
            NRF_LOG_INFO("TCS34725 READ REG CB : Queue send fail");
        }
        xTaskNotifyGive(m_ble_tcs_reg_send_thread);
    }
    else
    {
        if(pdPASS!=xQueueOverwrite(m_tcs_reg_data_queue,&tcs_ble_send_str))
        {
            NRF_LOG_INFO("TCS34725 READ REG CB : Queue overwrite fail");
        }
    }
    
}

void tcs34725_read_thr_cb(ret_code_t result, tcs34725_threshold_data_t * p_reg_data)
{
    if(result!=NRF_SUCCESS)
    {
        NRF_LOG_INFO("TCS34725 Threshold register read fail");
        return;
    }

    char read_thr_cb_cmd[]="CMD";
    p_reg_data->reg_addr&=0x1F;

    NRF_LOG_INFO("Threshold CB : %X",p_reg_data->reg_addr);

    if(p_reg_data->reg_addr==TCS34725_REG_THRESHOLD_LOW_L)
    {
        NRF_LOG_INFO("Threshold Low value : %d",p_reg_data->threshold_data);
        strcpy(read_thr_cb_cmd,"THL");

    }
    else
    {
        NRF_LOG_INFO("Threshold High value : %d",p_reg_data->threshold_data);
        strcpy(read_thr_cb_cmd,"THH");
    }

    tcs34725_ble_reg_t tcs_ble_send_str;
    sprintf(tcs_ble_send_str.send_data,"%s%5d",read_thr_cb_cmd,p_reg_data->threshold_data);
    vPortFree(p_reg_data);
    uint16_t heap_left_size;
    heap_left_size=xPortGetFreeHeapSize();
    printf("thr cb : %d\r\n",heap_left_size);

    if(uxQueueSpacesAvailable(m_tcs_reg_data_queue)!=0)
    {
        if(pdPASS!=xQueueSend(m_tcs_reg_data_queue,&tcs_ble_send_str,10))
        {
            NRF_LOG_INFO("TCS34725 THRESHOLD CB : Queue send fail");
        }
        xTaskNotifyGive(m_ble_tcs_reg_send_thread);
    }
    else
    {
        if(pdPASS!=xQueueOverwrite(m_tcs_reg_data_queue,&tcs_ble_send_str))
        {
            NRF_LOG_INFO("TCS34725 THRESHOLD CB : Queue overwrite fail");
        }
    }
    
}

void tcs34725_rgbc_cb(ret_code_t result, tcs34725_rgbc_data_t * p_raw_data)
{
    tcs34725_rgbc_data_t tcs_rgbc_cb_str;

    if(result!=NRF_SUCCESS)
    {
        NRF_LOG_INFO("TCS34725 RGBC register read fail");
        return;
    }

    tcs_rgbc_cb_str.clear=p_raw_data->clear;
    tcs_rgbc_cb_str.red=(int)((double)p_raw_data->red/p_raw_data->clear*255);
    tcs_rgbc_cb_str.green=(int)((double)p_raw_data->green/p_raw_data->clear*255);
    tcs_rgbc_cb_str.blue=(int)((double)p_raw_data->blue/p_raw_data->clear*255);
    
//    printf("clear : %d, red : %d, blue : %d, green : %d\r\n",
//            p_raw_data->clear,p_raw_data->red,p_raw_data->green,p_raw_data->blue);

    if(uxQueueSpacesAvailable(m_tcs_rgb_data_queue)!=0)
    {
        if(pdTRUE!=xQueueSend(m_tcs_rgb_data_queue, &tcs_rgbc_cb_str, 10))
        {
            NRF_LOG_INFO("TCS34725 RGBC CB : Queue send fail\r\n");
        }
        xTaskNotifyGive(m_ble_tcs_rgbc_send_thread);
    }
    else
    {
        if(pdTRUE!=xQueueOverwrite(m_tcs_rgb_data_queue, &tcs_rgbc_cb_str))
        {
            NRF_LOG_INFO("TCS34725 RGBC CB : Queue overwrite fail\r\n");
        }
    }
}

/* Thread
 */
static void tcs_read_all_reg_thread(void *arg)
{
    #ifdef STACK_SIZE_CHK
    configSTACK_DEPTH_TYPE uxHighWaterMark2;
    uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
    uint8_t stack_left=255;
    #endif

    uint16_t heap_left_size;
    heap_left_size=xPortGetFreeHeapSize();
    printf("1 left heap size : %d\r\n",heap_left_size);
    
    
    tcs34725_reg_data_t *all_reg_read=(tcs34725_reg_data_t*)pvPortMalloc(sizeof(tcs34725_reg_data_t)*8);

    tcs34725_threshold_data_t *threshold_low=(tcs34725_threshold_data_t*)pvPortMalloc(sizeof(tcs34725_threshold_data_t));
    tcs34725_threshold_data_t *threshold_high=(tcs34725_threshold_data_t*)pvPortMalloc(sizeof(tcs34725_threshold_data_t));
    
