lee35210/nRF52840_BLE_FREERTOS_TCS34725/main.c
    heap_left_size=xPortGetFreeHeapSize();
    printf("2 left heap size : %d\r\n",heap_left_size);

    while(1)
    {
        all_reg_read[0].reg_addr=TCS34725_REG_ENABLE;
        tcs34725_read_reg(&tcs34725_instance, &all_reg_read[0], tcs34725_read_reg_cb);
//        vTaskDelay(10);

        all_reg_read[1].reg_addr=TCS34725_REG_TIMING;
        tcs34725_read_reg(&tcs34725_instance, &all_reg_read[1], tcs34725_read_reg_cb);
//        vTaskDelay(10);
        
        all_reg_read[2].reg_addr=TCS34725_REG_WAIT_TIME;
        tcs34725_read_reg(&tcs34725_instance, &all_reg_read[2], tcs34725_read_reg_cb);
//        vTaskDelay(10);
        
        all_reg_read[3].reg_addr=TCS34725_REG_PERSISTENCE;
        tcs34725_read_reg(&tcs34725_instance, &all_reg_read[3], tcs34725_read_reg_cb);
//        vTaskDelay(10);
        
        all_reg_read[4].reg_addr=TCS34725_REG_CONFIG;
        tcs34725_read_reg(&tcs34725_instance, &all_reg_read[4], tcs34725_read_reg_cb);
//        vTaskDelay(10);
        
        all_reg_read[5].reg_addr=TCS34725_REG_CONTROL;
        tcs34725_read_reg(&tcs34725_instance, &all_reg_read[5], tcs34725_read_reg_cb);
//        vTaskDelay(10);
        
        all_reg_read[6].reg_addr=TCS34725_REG_ID;
        tcs34725_read_reg(&tcs34725_instance, &all_reg_read[6], tcs34725_read_reg_cb);
//        vTaskDelay(10);
        
        all_reg_read[7].reg_addr=TCS34725_REG_STATUS;
        tcs34725_read_reg(&tcs34725_instance, &all_reg_read[7], tcs34725_read_reg_cb);
//        vTaskDelay(10);

        threshold_low->reg_addr=TCS34725_REG_THRESHOLD_LOW_L;
        tcs34725_read_threshold(&tcs34725_instance, threshold_low, tcs34725_read_thr_cb);
//        vTaskDelay(10);

        threshold_high->reg_addr=TCS34725_REG_THRESHOLD_HIGH_L;
        tcs34725_read_threshold(&tcs34725_instance, threshold_high, tcs34725_read_thr_cb);
        
        #ifdef STACK_SIZE_CHK
        uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
        if(uxHighWaterMark2<stack_left)
        {
            stack_left=uxHighWaterMark2;
            printf("Available stack size of thread reading all TCS34725 register : %d\r\n",stack_left);
        }
        #endif

        vPortFree(all_reg_read);
//        vPortFree(all_reg_read_thr);
        heap_left_size=xPortGetFreeHeapSize();
        printf("3 left heap size : %d\r\n",heap_left_size);
        vTaskDelete(m_tcs_reg_all_send_thread);
    }
}

static void tcs_wr_reg_thread(void *arg)
{
    #ifdef STACK_SIZE_CHK
    configSTACK_DEPTH_TYPE uxHighWaterMark2;
    uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
    uint8_t stack_left=255;
    #endif

    ret_code_t err_code;
    tcs34725_cmd_t wr_cmd_str;

    while(1)
    {
        if((ulTaskNotifyTake(pdTRUE,10)!=0)&&(pdPASS==xQueueReceive(m_tcs_cmd_queue,&wr_cmd_str,10)))
        {
            tcs34725_cmd_func(&wr_cmd_str);
        }
        vTaskDelay(100);

        #ifdef STACK_SIZE_CHK
        uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
        if(uxHighWaterMark2<stack_left)
        {
            stack_left=uxHighWaterMark2;
            printf("Available stack size of TCS34725 WR thread : %d\r\n",uxHighWaterMark2);
        }
        #endif
    }
}

static void tcs_read_rgbc_thread(void *arg)
{
    #ifdef STACK_SIZE_CHK
    configSTACK_DEPTH_TYPE uxHighWaterMark2;
    uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
    uint8_t stack_left=255;
    #endif

    tcs34725_rgbc_data_t tcs_rgbc_thread;
    
    while(1)
    {
        tcs34725_read_rgbc(&tcs34725_instance,&tcs_rgbc_thread,tcs34725_rgbc_cb);
        vTaskDelay(200);

        #ifdef STACK_SIZE_CHK
        uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
        if(uxHighWaterMark2<stack_left)
        {
            stack_left=uxHighWaterMark2;
            printf("Available stack size of RGBC read thread : %d\r\n",uxHighWaterMark2);
        }
        #endif
    }
}

static void ble_tcs_rgbc_send_thread(void *arg)
{
    #ifdef STACK_SIZE_CHK
    configSTACK_DEPTH_TYPE uxHighWaterMark2;
    uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
    uint8_t stack_left=255;
    #endif

    ret_code_t err_code;
    tcs34725_rgbc_data_t ble_tcs_send_rgb;
    char data_array[18]={};
    uint16_t length=sizeof(data_array);

    while(1)
    {
        if((ulTaskNotifyTake(pdTRUE,10)!=0)&&
          (pdPASS==xQueueReceive(m_tcs_rgb_data_queue, &ble_tcs_send_rgb, 10)))
        {
            sprintf(data_array,"RGB%5d%3d%3d%3d",ble_tcs_send_rgb.clear,ble_tcs_send_rgb.red,ble_tcs_send_rgb.green,
                    ble_tcs_send_rgb.blue);
            if(m_conn_handle!=BLE_CONN_HANDLE_INVALID)
            {
                err_code=ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);
                if ((err_code != NRF_ERROR_INVALID_STATE) &&
                    (err_code != NRF_ERROR_RESOURCES) &&
                    (err_code != NRF_ERROR_NOT_FOUND))
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            #ifdef STACK_SIZE_CHK
            uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
            if(uxHighWaterMark2<stack_left)
            {
                stack_left=uxHighWaterMark2;
                printf("Available stack size of thread sending RGBC data via BLE : %d\r\n",uxHighWaterMark2);
            }
            #endif
        }
    }
}

static void ble_tcs_reg_send_thread(void *arg)
{
    #ifdef STACK_SIZE_CHK
    configSTACK_DEPTH_TYPE uxHighWaterMark2;
    uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
    uint8_t stack_left=255;
    #endif

    ret_code_t err_code;
    tcs34725_ble_reg_t ble_tcs_send_reg;
    uint16_t length=sizeof(ble_tcs_send_reg);

    while(1)
    {
        if((ulTaskNotifyTake(pdFALSE,10)!=0)&&(pdPASS==xQueueReceive(m_tcs_reg_data_queue, &ble_tcs_send_reg, 10)))
        {
            if(m_conn_handle!=BLE_CONN_HANDLE_INVALID)
            {
                err_code=ble_nus_data_send(&m_nus, ble_tcs_send_reg.send_data, &length, m_conn_handle);
                if ((err_code != NRF_ERROR_INVALID_STATE) &&
                    (err_code != NRF_ERROR_RESOURCES) &&
                    (err_code != NRF_ERROR_NOT_FOUND))
                {
                    APP_ERROR_CHECK(err_code);
                }
            }

