lee35210/nRF52840_BLE_FREERTOS_TCS34725/main.c
            #ifdef STACK_SIZE_CHK
            uxHighWaterMark2=uxTaskGetStackHighWaterMark(NULL);
            if(uxHighWaterMark2<stack_left)
            {
                stack_left=uxHighWaterMark2;
                printf("Available stack size of thread sending register data via BLE : %d\r\n",uxHighWaterMark2);
            }
            #endif
        }
    }
}

static void task_create_func(void)
{
    
    if(pdPASS!=xTaskCreate(tcs_read_rgbc_thread, "TCS_RGBC_READ", configMINIMAL_STACK_SIZE+60, 
                           NULL, 3, &m_tcs_read_rgbc_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }

    if(pdPASS!=xTaskCreate(tcs_wr_reg_thread, "TCS_WR_REG", configMINIMAL_STACK_SIZE+160, 
                           NULL, 3, &m_tcs_wr_reg_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }
    if(pdPASS!=xTaskCreate(ble_tcs_rgbc_send_thread, "TCS_RGBC_BLE_SEND", configMINIMAL_STACK_SIZE+60, 
                           NULL, 3, &m_ble_tcs_rgbc_send_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }

    if(pdPASS!=xTaskCreate(ble_tcs_reg_send_thread, "TCS_REG_BLE_SEND", configMINIMAL_STACK_SIZE+60,
                           NULL, 3, &m_ble_tcs_reg_send_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }
#if NRF_LOG_ENABLED
    if (pdPASS!=xTaskCreate(logger_thread, "LOGGER", configMINIMAL_STACK_SIZE+250, NULL, 1, &m_logger_thread))
    {
        APP_ERROR_HANDLER(NRF_ERROR_NO_MEM);
    }
#endif
}

static void queue_create_func(void)
{
    //handling data read from TCS34725 RGBC register
    m_tcs_rgb_data_queue=xQueueCreate(1,sizeof(tcs34725_rgbc_data_t));
    
    //handling data read from TCS34725 register
    m_tcs_reg_data_queue=xQueueCreate(8,sizeof(tcs34725_ble_reg_t));
    
    //handling data receive from ble uart
    m_tcs_cmd_queue=xQueueCreate(8, sizeof(tcs34725_cmd_t));
}

void tcs34725_start()
{
    ret_code_t err_code;

    err_code=tcs34725_init(&tcs34725_instance);
    APP_ERROR_CHECK(err_code);

    err_code=tcs34725_set_timing(&tcs34725_instance, 150);  //1~256
    APP_ERROR_CHECK(err_code);

    err_code=tcs34725_set_wait_time(&tcs34725_instance, 50);   //1~256
    APP_ERROR_CHECK(err_code);

//    err_code=tcs34725_set_wait_long(&tcs34725_instance, TCS34725_WAIT_LONG_ENABLE);
//    APP_ERROR_CHECK(err_code);

    err_code=tcs34725_set_gain(&tcs34725_instance, TCS34725_GAIN_60x);
    APP_ERROR_CHECK(err_code);

//    err_code=tcs34725_set_interrupt(&tcs34725_instance, TCS34725_INTERRUPT_ENABLE);
//    APP_ERROR_CHECK(err_code);
    
    err_code=tcs34725_set_persistence(&tcs34725_instance, TCS34725_OUT_OF_RANGE_60);
    APP_ERROR_CHECK(err_code);

    err_code=tcs34725_set_threshold(&tcs34725_instance, TCS34725_THRESHOLD_LOW, 10000);
    APP_ERROR_CHECK(err_code);

    err_code=tcs34725_set_threshold(&tcs34725_instance, TCS34725_THRESHOLD_HIGH, 65535);
    APP_ERROR_CHECK(err_code);
}

void in_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    if(pin==TCS34725_INT_PIN)
    {
        ret_code_t err_code;
        int queue_space;

        NRF_LOG_INFO("TCS34725 RGBC Interrupt occured");

        static tcs34725_ble_reg_t tcs_int_alarm={0};
        strcpy(tcs_int_alarm.send_data,"INT");
        
        err_code=tcs34725_int_clear(&tcs34725_instance);
        APP_ERROR_CHECK(err_code);
        if(err_code==NRF_SUCCESS)
        {
            NRF_LOG_INFO("TCS34725 Clear channel interrupt clear");
        }
        
        if(uxQueueSpacesAvailable(m_tcs_reg_data_queue)!=0)
        {
            if(pdPASS!=xQueueSend(m_tcs_reg_data_queue,&tcs_int_alarm,10))
            {
                NRF_LOG_INFO("Interrupt queue send fail");
            }
            xTaskNotifyGive(m_ble_tcs_reg_send_thread);
        }
        else
        {
            if(pdPASS!=xQueueOverwrite(m_tcs_reg_data_queue,&tcs_int_alarm))
            {
                NRF_LOG_INFO("Interrupt queue overwrite fail");
            }
        }
    }
}

static void gpio_init(void)
{
    ret_code_t err_code;

    err_code = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_in_config_t in_config = GPIOTE_CONFIG_IN_SENSE_HITOLO(true);
    in_config.pull = NRF_GPIO_PIN_PULLUP;

    err_code = nrf_drv_gpiote_in_init(TCS34725_INT_PIN, &in_config, in_pin_handler);
    APP_ERROR_CHECK(err_code);

    nrf_drv_gpiote_in_event_enable(TCS34725_INT_PIN, true);
}

int main(void)
{
    ret_code_t err_code;
    bool erase_bonds;
    // Initialize.
    uart_init();
    log_init();
    bsp_board_init(BSP_INIT_LEDS);
    clock_init();
    timers_init();
    gpio_init();
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    peer_manager_init();

    twi_config();
    err_code=nrf_twi_sensor_init(&sensor_instance);
    APP_ERROR_CHECK(err_code);

    queue_create_func();
    task_create_func();
    
    //Set TCS34725 initialization value
    tcs34725_start();

    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    NRF_LOG_FLUSH();
    
    nrf_sdh_freertos_init(advertising_start,&erase_bonds);
    vTaskStartScheduler();

    // Enter main loop.
    for (;;)
    {
        APP_ERROR_HANDLER(NRF_ERROR_FORBIDDEN);
    }
}

/**
 * @}
 */
